app/views/gossips/index.html.erb

SELECT "potins".* FROM "potins"
---
    <div class="row">
        <% params[:potins].each do |potin| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."potin_id" = $1  [["potin_id", 1]]
---
                <h5 class="card-title"><%= potin.title %></h5>
                <p class="card-text">Un potin de <%= potin.user.first_name %>.</br>

                <span class="badge badge-pill badge-primary">Likes: <%= potin.likes.count %></span></br>