app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---

  <ul>Un potin de <%= @gossip.user.first_name %> <%= @gossip.user.last_name %>, de la ville de <%= link_to @gossip.user.city.name, city_path(@id = @gossip.user.city.id) %>:</br>

SELECT "comments".* FROM "comments" WHERE "comments"."potin_id" = $1  [["potin_id", 1]]
---
<! commments here >
<% comments = Comment.where(potin_id: @gossip.id) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
              <div class="card-body">
                  <h5 class="card-title">Par <%= comment.user.first_name %> <%= comment.user.last_name %>:</h5>