app/controllers/gossips_controller.rb

SELECT "potins".* FROM "potins"
---
  def index
    # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
    params[:potins] = Potin.all

SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
    @gossip = Potin.find(params[:id])